#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

module.demo.data.aws_iam_policy_document.aws_iam_policy_document: Reading...
module.demo.aws_glue_workflow.workflow: Refreshing state... [id=cq-workflow]
module.demo.data.aws_iam_policy_document.aws_iam_policy_document: Read complete after 0s [id=3118019012]
module.demo.aws_s3_bucket.aws_s3_bucket: Refreshing state... [id=cq-glue-target-bucket]
module.demo.aws_iam_role.aws_iam_role: Refreshing state... [id=AWSGlueServiceRole-cq-role]
module.demo.aws_iam_role_policy_attachment.aws_iam_role_policy_attachment: Refreshing state... [id=AWSGlueServiceRole-cq-role-20220727095104529500000001]
module.demo.aws_glue_job.example: Refreshing state... [id=cq-glue-job]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.demo.aws_glue_trigger.example will be created
  + resource "aws_glue_trigger" "example" {
      + arn         = (known after apply)
      + description = "test trigger"
      + enabled     = true
      + id          = (known after apply)
      + name        = "cq-glue-trigger"
      + state       = (known after apply)
      + tags_all    = (known after apply)
      + type        = "ON_DEMAND"

      + actions {
          + job_name = "cq-glue-job"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pusher: @irmatov, Action: `pull_request_target`, Working Directory: ``, Workflow: `terraform_plan`*